app/views/home/index.html.erb

SELECT `feedbacks`.* FROM `feedbacks` WHERE `feedbacks`.`id` = 1 LIMIT 1
---
										<%if user_signed_in?%>
											<%=image_tag(@graph.get_picture("#{Feedback.find(1).fb_id}"))%><br>