app/controllers/users/omniauth_callbacks_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'http://www.facebook.com/chetan.kumar.562' LIMIT 1
INSERT INTO `users` (`email`, `encrypted_password`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`, `sign_in_count`, `current_sign_in_at`, `last_sign_in_at`, `current_sign_in_ip`, `last_sign_in_ip`, `created_at`, `updated_at`) VALUES ('http://www.facebook.com/chetan.kumar.562', 'ySgmCmzBYZZsdmSvqcaT', NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, '2012-06-22 11:58:14', '2012-06-22 11:58:14')
UPDATE `users` SET `last_sign_in_at` = '2012-06-22 11:58:14', `current_sign_in_at` = '2012-06-22 11:58:14', `last_sign_in_ip` = '127.0.0.1', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2012-06-22 11:58:14' WHERE `users`.`id` = 1
---
  def facebook
		data = request.env["omniauth.auth"].extra.raw_info
		session[:access_token] = request.env["omniauth.auth"].credentials.token
		if data.email.nil?
				@email = data.link
		else
			@email = data.email
		end
		if @user = User.find_by_email(@email)
			@user
		else # Create a user with a stub password.
			@user = User.new
			@user.email = @email
			@user.encrypted_password = Devise.friendly_token[0,20]
			@user.save(:validate => false)

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'chetankumar.virtueinfo@gmail.com' LIMIT 1
INSERT INTO `users` (`email`, `encrypted_password`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`, `sign_in_count`, `current_sign_in_at`, `last_sign_in_at`, `current_sign_in_ip`, `last_sign_in_ip`, `created_at`, `updated_at`) VALUES ('chetankumar.virtueinfo@gmail.com', 'Xv5RxcKKeP2szAfsmmbx', NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, '2012-07-14 11:01:15', '2012-07-14 11:01:15')
UPDATE `users` SET `last_sign_in_at` = '2012-07-14 11:01:15', `current_sign_in_at` = '2012-07-14 11:01:15', `last_sign_in_ip` = '127.0.0.1', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2012-07-14 11:01:15' WHERE `users`.`id` = 4
---
	def google
		data = request.env["omniauth.auth"].info
		if !data.email.nil?
			@email = data.email
		else
			@email = ""
		end

		if @user = User.find_by_email(@email)
			@user
		else # Create a user with a stub password.
			@user = User.new
			@user.email = @email
			@user.encrypted_password = Devise.friendly_token[0,20]
			@user.save(:validate => false)